app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "u"], ["password_digest", "$2a$10$vh1n0nsALq2qXvifq0TRRedWswujEWYy339SzXSdZeQbwQ7pS0dMu"], ["created_at", "2018-05-06 20:31:08.386390"], ["updated_at", "2018-05-06 20:31:08.386390"]]
---
  def create
    @user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def set_user
    # nice to have: slugifiable instead of id
    @user = User.find(params[:id])